"""
5. Реализовать структуру «Рейтинг», представляющую собой не
возрастающий набор натуральных чисел
(каждый элемент ряда меньше или равен предыдущему).

У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.

Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать непосредственно в коде,
например, my_list = [7, 5, 3, 3, 2].
"""
my_list = [4, 2, 6, 9, 1, 7]
new_el = None
while new_el != "quit":
    new_el = input("Введите рейтинг. Для выхода наберите quit: ")
    if new_el != "quit":
        my_list.append(int(new_el))
        my_list.sort(reverse=True)
print(f"Пользователь ввел число {new_el} результат {my_list}")

# Опять же старался не списывать :)
